# UCM-Net starter model: custom ESFENet backbone + YOLOv8 detect head

nc: 1
scales:
  n: [1.0, 1.0, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ESFENet, []]

head:
  - [0, 1, Index, [128, 0]]
  - [0, 1, Index, [256, 1]]
  - [0, 1, Index, [256, 2]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  - [[9, 12, 15], 1, Detect, [nc]]
